import numpy as np

nan = -1

# 这个是另外写代码算出来的，参考getNDVI_tomean.py。这里懒得再集成了
NDVI_mean_lucc = [nan, 6800.566943933502, 7532.791108550091, nan, 6536.138207225608, 7057.7190946435185, 5289.580808080805, 2006.9674749807468, 7042.577447823005, 6049.438561240883, 4784.440468697417, 3062.6556954581597, 5423.276648250048, 3402.29158875599, 6286.612643254121, nan, 1359.5592971975793, 498.1931051883652]

def getNDVI_mean_by_lucc(LUCC: int) -> float:
    """返回LULC代码对应的基底NDVI

    Parameters
    ----------
    LUCC : int
        LULC代码

    Returns
    -------
    float
        NDVI值（放大10000倍）
    """
    return NDVI_mean_lucc[LUCC]
